#Сделал на python потому что не знаю как сделать на go
#Задание1
print('Numder 1')
b=2.5
x=1.28
xk=3.28
xd=0.4
import math
while x<=xk:
    y=(1+math.sin(b**3+x**3))//((b**3+x**3)**(1//3))
    x=x+xd
    print(x)

#Задание 2
print('Numder 2')
b2=2.5
x1=1.1
x2=2.4
x3=3.6
x4=5.21
x5=4.16
y1=(1+math.sin(b2**3+x1**3))//((b2**3+x1**3)**(1//3))
y2=(1+math.sin(b2**3+x2**3))//((b2**3+x2**3)**(1//3))
y3=(1+math.sin(b2**3+x3**3))//((b2**3+x3**3)**(1//3))
y4=(1+math.sin(b2**3+x4**3))//((b2**3+x4**3)**(1//3))
y5=(1+math.sin(b2**3+x5**3))//((b2**3+x5**3)**(1//3))
print(y1, y2, y3, y4, y5)